In [273]:
import pandas as pd

In [274]:
import numpy as np

In [275]:
student_data_to_load= "Resources/students_complete.csv"

In [276]:
student_data_df = pd.read_csv(student_data_to_load)

In [277]:
# Add each prefix and suffix to remove to a list.
prefixes_suffixes = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]

In [278]:
# Iterate through the "prefixes_suffixes" list and replace them with an empty space, "" when it appears in the student's name.
for word in prefixes_suffixes:
    student_data_df["student_name"] = student_data_df["student_name"].str.replace(word,"")

In [279]:
school_data_to_load="Resources/schools_complete.csv"

In [280]:
school_data_df= pd.read_csv(school_data_to_load)

In [281]:
school_data_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [282]:
district_summary_df = pd.DataFrame(columns=["Total Schools","Total Students","Total Budget","Average Math Score", "Average Reading Score","Passing Math","Passing Reading", "Overall Passing"])

In [283]:
student_data_df.loc[student_data_df['grade'] == '9th', ['math_score']] = np.nan

In [284]:
district_summary_df

Empty DataFrame
Columns: [Total Schools, Total Students, Total Budget, Average Math Score, Average Reading Score, Passing Math, Passing Reading, Overall Passing]
Index: []

In [285]:
student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,NaN
1,1,Victor Smith,M,12th,Huang High School,94,61.0
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60.0
3,3,Richard Scott,M,12th,Huang High School,67,58.0
4,4,Bonnie Ray,F,9th,Huang High School,97,NaN

In [286]:
x=school_data_df["School ID"].count()
print(x)

15

In [287]:
district_summary_df["Total Schools"]=[x]
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,Passing Math,Passing Reading,Overall Passing
0,15,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [288]:
x=student_data_df["Student ID"].count()
x

39170

In [289]:
district_summary_df["Total Students"]=[x]
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,Passing Math,Passing Reading,Overall Passing
0,15,39170,NaN,NaN,NaN,NaN,NaN,NaN

In [290]:
x=school_data_df["budget"].sum()
x

24649428

In [291]:
district_summary_df["Total Budget"]=[x]
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,Passing Math,Passing Reading,Overall Passing
0,15,39170,24649428,NaN,NaN,NaN,NaN,NaN

In [292]:
x=student_data_df["reading_score"].mean()
x

81.87784018381414

In [293]:
district_summary_df["Average Reading Score"]=[x]
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,Passing Math,Passing Reading,Overall Passing
0,15,39170,24649428,NaN,81.87784,NaN,NaN,NaN

In [294]:
x=student_data_df["math_score"].mean()
x

79.00579929399899

In [295]:
district_summary_df["Average Math Score"]=[x]
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,Passing Math,Passing Reading,Overall Passing
0,15,39170,24649428,79.005799,81.87784,NaN,NaN,NaN

In [296]:
x=student_data_df.loc[student_data_df["reading_score"] >= 70]["reading_score"].count()

In [297]:
y=district_summary_df["Total Students"].sum()
y

39170

In [298]:
x=student_data_df.loc[student_data_df["math_score"] >= 70]["math_score"].count()

In [299]:
y=district_summary_df["Total Students"].sum()
y

39170

In [300]:
district_summary_df["Passing Math"]=[float(x)/float(y)]
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,Passing Math,Passing Reading,Overall Passing
0,15,39170,24649428,79.005799,81.87784,0.531402,NaN,NaN

In [301]:
district_summary_df["Passing Reading"]=[float(x)/float(y)]
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,Passing Math,Passing Reading,Overall Passing
0,15,39170,24649428,79.005799,81.87784,0.531402,0.531402,NaN

In [302]:
district_summary_df.head()

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,Passing Math,Passing Reading,Overall Passing
0,15,39170,24649428,79.005799,81.87784,0.531402,0.531402,NaN

In [303]:
student_data_df.loc[student_data_df["math_score"] >= 70]

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
6,6,Sheena Carter,F,11th,Huang High School,82,80.0
8,8,Michael Roth,M,10th,Huang High School,95,87.0
9,9,Matthew Greene,M,10th,Huang High School,96,84.0
10,10,Andrew Alexander,M,10th,Huang High School,90,70.0
11,11,Daniel Cooper,M,10th,Huang High School,78,77.0
...,...,...,...,...,...,...,...
39163,39163,John Reese,M,11th,Thomas High School,90,75.0
39165,39165,Donna Howard,F,12th,Thomas High School,99,90.0
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70.0
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90.0
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75.0

In [304]:
student_data_df.tail(10)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
39160,39160,Katie Weaver,F,11th,Thomas High School,89,86.0
39161,39161,April Reyes,F,10th,Thomas High School,70,84.0
39162,39162,Derek Weeks,M,12th,Thomas High School,94,77.0
39163,39163,John Reese,M,11th,Thomas High School,90,75.0
39164,39164,Joseph Anthony,M,9th,Thomas High School,97,NaN
39165,39165,Donna Howard,F,12th,Thomas High School,99,90.0
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70.0
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,NaN
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90.0
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75.0

In [305]:
ninth=student_data_df.loc[(student_data_df["school_name"]=="Thomas High School") & (student_data_df["grade"]=="9th")]

In [306]:
ninth

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
37537,37537,Erik Snyder,M,9th,Thomas High School,80,NaN
37538,37538,Tanya Martinez,F,9th,Thomas High School,71,NaN
37539,37539,Noah Erickson,M,9th,Thomas High School,86,NaN
37540,37540,Austin Meyer,M,9th,Thomas High School,73,NaN
37543,37543,Madison Hampton,F,9th,Thomas High School,82,NaN
...,...,...,...,...,...,...,...
39152,39152,Lori Moore,F,9th,Thomas High School,98,NaN
39153,39153,William Hubbard,M,9th,Thomas High School,80,NaN
39157,39157,Kristen Gonzalez,F,9th,Thomas High School,79,NaN
39164,39164,Joseph Anthony,M,9th,Thomas High School,97,NaN
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,NaN

In [307]:
ninthcount=ninth["Student ID"].count()

In [308]:
student_data_df.loc[(student_data_df["grade"]=="9th")]

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,NaN
4,4,Bonnie Ray,F,9th,Huang High School,97,NaN
5,5,Bryan Miranda,M,9th,Huang High School,94,NaN
12,12,Brittney Walker,F,9th,Huang High School,64,NaN
13,13,William Long,M,9th,Huang High School,71,NaN
...,...,...,...,...,...,...,...
39152,39152,Lori Moore,F,9th,Thomas High School,98,NaN
39153,39153,William Hubbard,M,9th,Thomas High School,80,NaN
39157,39157,Kristen Gonzalez,F,9th,Thomas High School,79,NaN
39164,39164,Joseph Anthony,M,9th,Thomas High School,97,NaN
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,NaN

In [309]:
ninthgradetotal=student_data_df.loc[(student_data_df["grade"]=="9th")]["grade"].count()

In [310]:
studenttotal=student_data_df["grade"].count()

In [311]:
studentwithoutninthegradetotal=studenttotal-ninthgradetotal

In [312]:
studentwithoutninthegradetotal

27762

In [313]:
nonninthgraders=student_data_df.loc[(student_data_df["grade"]!="9th")]

In [314]:
nonninthgraderspassingreading=nonninthgraders.loc[nonninthgraders["reading_score"] >= 70]["reading_score"].count()

In [315]:
nonninthgraderspassingmath=nonninthgraders.loc[nonninthgraders["math_score"] >= 70]["math_score"].count()

In [316]:
nonninthgraderspassingreadingpct=nonninthgraderspassingreading/studentwithoutninthegradetotal

In [317]:
nonninthgraderspassingmathpct=nonninthgraderspassingmath/studentwithoutninthegradetotal

In [318]:
# Determine the School Type
per_school_types = school_data_df.set_index(["school_name"])["type"]
# Calculate the total student count.
per_school_counts = school_data_complete_df["school_name"].value_counts()
# Calculate the total school budget and per capita spending
per_school_budget = (school_data_complete_df.groupby(["school_name"]).mean
()["budget"]).astype(np.int64)
# Calculate the per capita spending.
per_school_capita = (per_school_budget / per_school_counts).astype(np.int64)
# Calculate the average test scores.
per_school_math = school_data_complete_df.groupby(["school_name"]).mean()["math_score"]
per_school_reading = school_data_complete_df.groupby(["school_name"]).mean()["reading_score"]
# Calculate the passing scores by creating a filtered DataFrame.
per_school_passing_math = school_data_complete_df[(school_data_complete_df["math_score"] >= 70)]
per_school_passing_reading = school_data_complete_df[(school_data_complete_df["reading_score"] >= 70)]
per_school_passing_math = per_school_passing_math.groupby(["school_name"])
count()["student_name"]
per_school_passing_reading = per_school_passing_reading.groupby(["school_name"]).count()["student_name"]
# Calculate the percentage of passing math and reading scores per school.
per_school_passing_math = per_school_passing_math / per_school_counts * 100
per_school_passing_reading = per_school_passing_reading / per_school_counts* 100
# Calculate the students who passed both reading and math.
per_passing_math_reading = school_data_complete_df[(school_data_complete_df["reading_score"] >= 70)]& (school_data_complete_df["math_score"] >= 70)]
# Calculate the number of students passing math and passing reading by school

per_passing_math_reading = per_passing_math_reading.groupby(["school_name"]).count()["student_name"]
# Calculate the percentage of passing math and reading scores per school.
per_overall_passing_percentage = per_passing_math_reading / per_school_counts * 100

SyntaxError: invalid syntax (<ipython-input-318-28edcb8faa0f>, line 23)

In [ ]:
# Create the DataFrame
per_school_summary_df = pd.DataFrame({
"School Type": per_school_types,
"Total Students": per_school_counts,
"Total School Budget": per_school_budget,
"Per Student Budget": per_school_capita,
"Average Math Score": per_school_math,
"Average Reading Score": per_school_reading,
"% Passing Math": per_school_passing_math,
"% Passing Reading": per_school_passing_reading,
"% Overall Passing": per_overall_passing_percentage})
per_school_summary_df.head()

In [ ]:
# Format the Total School Budget and the Per Student Budget
per_school_summary_df["Total School Budget"] = per_school_summary_df["TotalSchool Budget"].map("${:,.2f}".format)
per_school_summary_df["Per Student Budget"] = per_school_summary_df["Per Student Budget"].map("${:,.2f}".format)
# Display the data frame
per_school_summary_df.loc[['Thomas High School']]
#[['Total School Budget','Per Student Budget']])